{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"layers": [{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"inner_activation": "hard_sigmoid", "trainable": true, "inner_init": "orthogonal", "output_dim": 512, "unroll": false, "consume_less": "cpu", "init": "glorot_uniform", "dropout_U": 0.0, "input_dtype": "float32", "b_regularizer": null, "input_length": null, "dropout_W": 0.0, "activation": "tanh", "stateful": false, "batch_input_shape": [null, 30, 300], "U_regularizer": null, "name": "lstm_4", "go_backwards": false, "input_dim": 300, "return_sequences": true, "W_regularizer": null, "forget_bias_init": "one"}}, {"class_name": "LSTM", "config": {"U_regularizer": null, "input_length": null, "name": "lstm_5", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "init": "glorot_uniform", "stateful": false, "unroll": false, "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "consume_less": "cpu", "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "input_dim": 512, "forget_bias_init": "one", "output_dim": 512}}, {"class_name": "LSTM", "config": {"U_regularizer": null, "input_length": null, "name": "lstm_6", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "init": "glorot_uniform", "stateful": false, "unroll": false, "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "consume_less": "cpu", "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "input_dim": 512, "forget_bias_init": "one", "output_dim": 512}}]}, {"class_name": "Sequential", "config": [{"class_name": "Reshape", "config": {"target_shape": [4096], "batch_input_shape": [null, 4096], "trainable": true, "name": "reshape_2", "input_dtype": "float32"}}]}], "name": "merge_2", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_5", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1024}}, {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_5"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_6", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1024}}, {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_6"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_5"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_7", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1024}}, {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_7"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_6"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_8", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1000}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_8"}}]}